{"content": "# [Paella](#)\n\n## Outline\n\nHow is paella going to work?\n\nTwo deployment scenarios:\n\n1. Set up a network in the office or workplace of a person who creates servers \n   for people.  This person can use paella to create fully configured machines \n   that can be physically carried and installed at another location.\n\n2. Set up a network where the hosts on the network are installed and managed \n   by a paella server.\n\n## Where is this stuff useful?\n\nPaella is not designed for deploying debian systems in a cloud environment.  \nThere are plenty of tools to help with this, and ability to use \n[salt](saltstack.org), or another configuration system, is already \ngenerally available.  Paella, due to how it uses the debian installer \nin an automated fashion, could be useful in creating the base images that \nwill be deployed in a cloud environment, but this is not why it was \ndesigned.\n\nPaella could be very useful in server farms where machines are added and \nremoved as needed.  Again, I didn't design paella for use in those \nenvironments, but it could be very easily done.  If each machine in the \nserver farm was configured to boot from the network automatically, and \nthe autoinstall property is set for each machine, the network can be \ncompletely managed remotely.\n\n## Interesting Links\n\nhttp://sourceforge.net/projects/unattended/\n\nhttp://www.thewindowsclub.com/the-system-preparation-tool-sysprep-in-microsoft-windows-7\n\nhttp://www.thinkwiki.org/wiki/Windows_PE\n\nhttp://technet.microsoft.com/en-us/library/cc709665(WS.10).aspx\n\nhttps://eldon.me/?p=73\n\n\nDriverPacks with Sysprep\n\nhttp://forum.driverpacks.net/viewtopic.php?id=4849\n\n## Windows Stuff\n\n### Netboot a PE environment\n\nUse wimlib to make pe iso.\nnetboot iso and server iso http instead of tftp (ipxe or gpxe?)\n\nor\n\nUse PXE entirely, (seems that sending the winpe.wim will \ntake too long).\n\n### Configure PE environment\n\nAnother approach:  make custom winpe iso for each machine on demand.\nAutounattend.xml for specific machine on iso root directory.\nmachine.ini for machine information\n\nwinpe environment script:\n\n```\nnet use z: \\\\paella\\win7\nz:\nsetup.exe\n```\n\nHopefully if windows installer picks up Autounattend.xml on cd drive\nthings will be ok.  It did!\n\n### Learn GuiRunOnce\n\nAttempt to stick python and autoit on the base system after install.\n\nEvery windows system will have python installed.  Autoit will either \nbe installed permanently, or placed in a temporary location to \nexecute the configuration scripts before being removed.  In this \ncircumstance, the autoit binary will have to be provided by the \nconfiguration provisioner to execute the autoit scripts.\n\n\n### Set up reference environment\n\n- Use the automated install to install base system.\n\n- Manually install the applications and configure the sytem.\n\n- Use sysprep to prepare the system for capture.\n\n- Reboot system from network to standard live system\n\n- Use wimcapture to make .wim image of reference install\n\n- Next boot the target machine and use imagex apply on drive\n\n\t- does it need partitioning/formatting?  Should we do this \n\t  setup-storage from FAI or write some tools?  Using debian\n\t  servers eliminates some of the necessity for complex drive\n\t  systems on the windows hosts.\n\t\n\t- can we do the bcdboot stage with wimlib?  If not we need to \n\t  boot into WinPE environment and use it there.\n\t  \n### Look at using salt windows software repo\n\nsalt-minion on windows\n\npreseeded keys can be included in winpe.iso\n\n### Driverpacks\n\n- slipstream driverpacks into iso\n\n\t- can this be done entirely within debian?\n\t\n\t- easily?\n\t\n- use a samba share for the driverpacks\n\n\t- still need to have network drivers available beforehand\n\t\n- store driverpacks installer in system wim\n\n\t- most every system should work, but wim is much larger\n\t\n\t- store driverpacks installer with local network drivers on system\n\t  wim, then driverpack install from samba share\n\t  \n\t  \n\t\n\t\n", "id": "deployment"}