{"content": "# [Paella](#)\n\n## General Install Procedure  \n\n### Procedure when the machine is introduced to the network\n\n1. Boot machine from network into live system.  When the machine\n   finishes rendering the desktop screen, lauch a terminal emulator.\n\n2. At command prompt type: paella-submit-machine <name>\n   where <name> is the name of the machine.\n   \n3. Next (optionally), type: paella-set-install.  This will instruct \n   the server to create pxe config files for the system\n   uuid of the machine.  \n\n4. The attributes in the database for the machine will direct the\n   pxe config that will be generated.  The type of os, architecture,\n   and release are all considered when making the pxeconfig file.\n   The default parameters for the machine is a debian stable system\n   with a simple atomic filesystem recipe. on the architecture of the live\n   system that the machine was submitted with.  These attributes\n   can be manipulated on the paella web interface prior to installing the\n   machine.\n   \n### Procedure when machine set to be installed:\n \n1. Boot machine from network.  The pxe menu will have an install\n   entry at the top that provides the installer with a preseed file \n   generated for the machine.  The user must press enter to boot debian \n   pxe image.\n \n2. The machine will then boot the standard debian installer and install \n   a basic system.  The preseed file should provide a way through the \n   early command to send a recipe file to the installer system.  At the \n   moment, the only filesystem being used is the atomic/lvm as provided \n   in the standard debian example preseed file.\n \n3. The debian installer will also install salt-minion.  \n\n4. The late command will retrieve a script from the server and \n   execute it.  This script is responsible for identifying the \n   machine for the salt master.  The script will be rendered from \n   a mako template server side with the information that identifies \n   the machine.  The actual identifier of the machine is the URL \n   from where the script is retrieved.\n   \n5. The script will also send a POST request to the server instructing it \n   that the debian install procedure is about to complete.  The server will \n   then remove the special pxe config file.\n\n6. Once the late command finishes, the debian installer tidies up and \n   unmounts the filesystems, then reboots.  If the machine doesn't default \n   to booting from the network and will boot from the hard drive, the \n   second stage of the installation will continue.  If the machine boots \n   from the network, the default menu option is to boot from the hard \n   drive.\n   \n \n", "id": "install-procedure"}