{"content": "# [Paella](#)\n\n## Introduction \n\nPaella is a system for automatically installing fully configured \n[debian](https://debian.org) machines on a local network, and managing \ntheir configuration.  Paella combines PXE booting, preseeded base debian \ninstalls, and [salt](https://saltstack.com) to install a fully configured \nsystem and maintain the configuration.  Paella can also automatically install\n[Microsoft Windows](https://microsoft.com) systems, however this\nis currently a feature that needs much work.\n\nPaella requires quite a few things in order to operate.  The best way to \nget things started is to use [Virtual Box](https://virtualbox.org) and \n[Vagrant](https://vagrantup.com) to install and configure the Paella \nserver.  The complexity of installing and configuring the network \nservices, creating the debian repositories, creating and installing \nthe default live system, is handled by provisioning the vagrant virtual \nmachine with salt.  Instructions for using vagrant to setup paella are \n[here](#pages/vagrant).\n\n## That was then, this is now\n\nPaella is not a new project.  It has been rewritten entirely from scratch.\nYou are looking at what could best be called version 2.  A brief overview\nof version 1, and the inspiration for paella and some of what it did is on\nthe [\"history page\"](#page/history).\n\nConfiguration management never made it past install.  Using paella (v1)\nto keep and maintain a configuration would require some sort of state\nmanagement that was more easily presumed with a fresh install, than\ncould be easily done after deployment.  This required to much time and\nattention in the past when good configuration management systems were\nfew and far between.  My dislike for [PERL](http://perl.com) kept me from\ncontributing to [FAI](https://fai-project.org) as well as using cfengine.\nI briefly looked into using bcfg2, but couldn't quite get it working\nto my satisfaction.\n\nAt sometime, when paella v1 was showing its age,\n[puppet](https://puppetlabs.com) was\nbecoming quite popular.  Puppet became popular enough to seem to inspire\nother configuration management systems.  This lead me to look again for another\nconfiguration management system that was based upon python.  There were a\nfew systems to choose from, but the choice was between\n[ansible](https://ansible.com) and [salt](https://saltstack.com).  I wound\nup using salt, primarily for the use of [zeromq](https://zeromq.org) for\ncommunication.\n\n## Paella and FAI\n\nPaella was originally inspired by [FAI](https://fai-project.org), and in fact,\nthe earliest incarnation was a set of python scripts that communicated with\na [postgresql](https://postgresql.org) database.  Much of the manner in\nwhich paella operated was in many ways similar to FAI, especially the ability to\nhook into and modify each part of the installation process.  The desire to create\na project similar to FAI, rather than contribute, was honestly based upon a\nstrong preference for using [python](https://python.org) instead of\n[perl](https://perl.com) for development.\n\nUnlike, FAI, paella is no longer using the [debian-live](https://live.debian.net/)\nto install the debian systems.  Instead, the\n[debian installer](https://www.debian.org/devel/debian-installer/) is being\nused to [install](#pages/debian-install) the base system\nand prepare it to be configured with salt on the\nnext reboot.  Up until the present rewrite, paella depended upon \n[fai-setup-storage](https://packages.debian.org/unstable/main/fai-setup-storage),\nwhich was thoughtfully split from the other FAI packages, as it proves to be\nvery useful.  There exists a possibility that fai-setup-storage may be included\nalong with febootstrap to automatically install rpm type systems.\n\nAlso, paella uses a [web server](#pages/paella-server) to help with the installation and\nmanagement of the machines.  While the browser application is still in it's\ninfancy and only performs the most minimal of management functions, the\napi it provides allows the debian installs to retrieve preseed files and special\nscripts that are specific to each machine.  The setup is used to inform the\npaella server when debian install is completed on each machine, deconfiguring\nthe specific PXE configuration file that booted the machine and providing for\nfurther configuration with salt upon reboot.\n\n## Windows\n\nPaella has the ability to install Microsoft Windows 7 over the network.  Evaluation\n[iso images](http://answers.microsoft.com/en-us/windows/forum/windows_7-windows_install/cannot-find-digital-river-download-site/66a8439b-0d16-4b70-92f7-1c8486a46ebf) can be obtained to help with development.  In the development environment,\nan evaluation iso for both i386 and amd64 are mounted loopback on the server and\nserved through samba.  A special iso is created on the server using\n[wimlib](http://wimlib.sourceforge.net/) that contains a script to\nmount the samba share and start an unattended install.\n\nAutomated installations of windows have been inspired by\n[unattended](http://unattended.sourceforge.net/).  The ability to\ninstall and configure a windows system in a manner similar to FAI or paella\nis appealing, however the length of time and excessive rebooting required\nby windows makes it infeasible to automate installs in this manner.  Instead,\na middle road will be taken by working to automate the creation of\nreference images that can be automatically installed with paella.\n\nThe installation of a reference image over the network is rather interesting.  The\ndebian-live system partitions the disk and creates an NTFS filesystem, then uses\nwimlib-imagex to install the image to the filesystem.  After this, a\n[virtualbox](https://virtualbox.org) VM is created and the physical\nhard drive on the machine is attached to it.  The VM then boots from an iso\nthat runs a script to configure the boot manager.  The windows machine is\ncompletely installed and ready to boot without having to leave the\ndebian-live system!  The simple script that does this can be viewed\n[here](https://github.com/umeboshi2/paella/blob/master/vagrant/salt/roots/salt/debianlive/install-win7-image.sh).\n\n\n\n\n\n\n\n\n\n\n", "id": "intro"}