{"content": "# [Paella](#)\n\n\n## Introduction \n\nPaella is a system for automatically installing fully configured \n[debian](https://debian.org) machines on a local network, and managing \ntheir configuration.  While the focus is on debian systems, it is currently\npossible to extend paella with little development effort to install other\nlinux distributions that are capable of netboot installs.  In all honesty, as\nlong as an operating system supports netboot installs, or if it can be\ninstalled using a [debian live](http://live.debian.net) system that is\nbooted over the wire or from media (possibly with the help of virtualbox or\nsome other tool), it can be installed with paella.  If the operating system\nis capable of running a [salt-minion](https://saltstack.com) after install,\nit can be configured either continuously, or as needed, with paella.  Currently,\nthis includes many major linux distrubutions, newer apple operating systems,\nand microsoft windows systems.\n\nWhile the possibilities seem numerous, the cold hard fact is that this is a\nproject created by a single developer to perform installation and configuration\nmanagement operations on a smaller range of operating systems and\nhardware configurations.  However, I have taken the time to keep the\nframework open and flexible.  The configuration management system is\nactually an open and fair game.  There should not be much difficulty in\nusing another system such as ansible or puppet if desired.  The example\nsalt configuration that is provided isn't required for operation, and is also\nnot highly opinionated.\n\nThe machine management data is split between a postgresql database\nand the configuration management system, which is currently salt.  The\npostgresql database houses the minion_id/hostname and system-uuid\nof the machine, as well as the disk configuration held in the form of\ndebian-installer expert recipes.  The decision to have this split, instead\nof a centralized data store stems from the desire to keep the configuration\nmanagement system as open as possible and determine the best way\nto link the information in the database to the preferred configuration\nsystem.  I feel that this opportunity for flexibility overrides the desire for\na completely central database at this point in the development of the\nproject.\n\n## Features\n\n[Here](#pages/features) is a `tl;dr` page of features.  Not many features, but extensively\nexplained.  Not \"featuritis\", yet a few features with a lot of reasoning.\n\n## Getting Started\n\nPaella requires quite a few things in order to operate.  The best way to \nget things started is to use [Virtual Box](https://virtualbox.org) and \n[Vagrant](https://vagrantup.com) to install and configure the Paella \nserver.  The complexity of installing and configuring the network \nservices, creating the debian repositories, creating and installing \nthe default live system, is handled by provisioning the vagrant virtual \nmachine with salt.  Instructions for using vagrant to setup paella are \n[here](#pages/vagrant).\n\n\n## Planned Usage and Development Direction\n\nIt seems to be quite often when a fully automated network installer is\nconsidered to be necessary for an environment, there is a large farm\nof very similar machines performing very similar functions.  Outside of\nidentifying and keeping track of the machines, they are not otherwise\ntreated differently.\n\nIt also seems to be that investment in time and knowledge required to\nimplement a fully automated network installation and configuration\nmanagement system drives the price of service considerably in order\nfor the developer of the system to receive an adequate return on the\ninvestment spent.\n\nThe result of these facts seem to indicate that this type of software (or\nservice) is often labelled as \"enterprise\" quality, with a price tag attached\nthat exceeds the budget for many smaller businesses that are required to\nkeep and maintain a small computer network.  The goal of paella is to\ndeliver a similar service to a business that is almost big enough to require\nan internal IT person, or some small businesses that have IT but need help\nwith system and network administration.\n\n\n\n", "id": "intro"}