{"content": "# [Javascript Dependencies](#)\n\n# Basic Javascript Libraries\n\n-  [CoffeeScript](http://coffeescript.org/):\n   The app is written with coffee script.\n  \n-  [Requirejs](http://requirejs.org):\n   This library is required to load the other modules.\n   \n-  [jQuery](http://jquery.com/): \n   jQuery is a very good for selecting and maninpulating elements in the DOM.\n\n-  [jQuery User Interface](http://jqueryui.com/): \n   jQueryUI is used for the fullcalendar widget, as well as for dialog boxes \n   and other user interface elements that aren't used through boostrap.  The \n   corresponding styles are maintained with compass.\n\n-  [Bootstrap v3](http://getbootstrap.com/): \n   Bootstrap is a CSS/Javascript framework used to help make responsive \n   websites.  Bootstrap was selected to be used in order to serve to \n   mobile devices.  The CSS is handled through compass with bootstrap-sass.\n   \n-  [LoDash](FIXME): \n   I decided to use lodash instead of underscore.  Quite a few of the\n   utilities provided by this library are easily handled with coffee script,\n   however, backbone and marionette depend on this library.\n\n-  [Backbone.js](http://backbonejs.org/): \n   Backbone is an excellent library that provides an api to make very \n   rich views tied to models that are seamlessly synchronized with \n   the server via a REST interface.\n\n-  [Marionette](http://marionettejs.com/):\n   \"Backbone.Marionette is a composite application library for \n   Backbone.js that aims to simplify the construction of large scale \n   JavaScript applications,\" and it is very effective at doing this.\n   This is the primary library used in this project for creating \n   single page applications.\n\n-  [Ace Editor](http://ace.c9.io/#nav=about): \n   The ACE editor is a good text editor that is very useful for \n   editing html, css, java/coffee scripts, and other formats that\n   aren't being used yet.\n   \n-  [Teacup](http://goodeggs.github.io/teacup/):\n   I really like teacup.  This selection is a result of a\n   very intensive search and test pattern that looked at\n   many different javascript html templating solutions and\n   teacup really stood out.\n   \n-  [FullCalendar](http://arshaw.com/fullcalendar/): \n   FullCalendar is a very good library that provides an interactive \n   calendar where events can be retrieved dynamically and grouped, \n   colored, or otherwised styled in many ways.  The calendar provides \n   monthly, weekly, and daily view models to interact with.\n   **FullCalendar hasn't been used in paella**\n\n-  [jQuery User Interface](http://jqueryui.com/): \n   jQueryUI is used for the fullcalendar widget, as well as for dialog boxes \n   and other user interface elements that aren't used through boostrap.  The \n   corresponding styles are maintained with compass.\n   **JQueryUI hasn't been used in paella**\n\n", "id": "jsdev"}