{"content": "# [Paella](#)\n\n### Preseed builder\n\nThe preseed is currently a [Mako](http://www.makotemplates.org/) template \nthat is served from the paella [server](#pages/paella-server). \n\nThe preseed file has certain responsibilities beyond automating the first \nstage of the installation.\n\n1. The early command must download and execute a  script that:\n\n\t- Has the ability to run in the minimal busybox environment.\n\t\n\t- Overrides the archive.gpg in the installer environment with the \n\t  key from the local repository. This is necessary because the \n\t  initrd contains the archive key and there is no other manner of\n\t  being able to retrieve the udeb packages from the local repository \n\t  other than modifying the initrd. **IMPORTANT**\n\t  \n2. The preseed file selects the network install interface.  This defaults to \n   eth0, but can be set in the database for machines with multiple interfaces.\n   **FIXME**  The netcfg select is currently done on kernel command line, while\n   the netcfg question in the preseed defaults to auto.\n\n3. The preseed file must add the salt and paella package repositories to\n   the apt sources, and make sure salt-minion is in the list of installed packages.\n\n4. The preseed file must handle the disk in the manner provided by the \n   recipe that is attached to the machine.  This is done by using placing the\n   recipe directly in the preseed file.\n   \n5. The late command must download and execute a script that:\n\n\t- Configures salt-minion with the identity of the machine.\n\t\n\t- Send a post request to the server informing it that stage one is almost\n\t  complete.  This will cause the server to delete the pxe config \n\t  files.  The default pxe config is configured to boot from the first \n\t  hard disk in ten seconds if a key isn't pressed, which helps in the \n\t  case that the computer always boots from the network first.\n\n\t- **OLD** Preseeds the salt-minion with the installer keys. (This isn't implemented\n\t  yet.  The master is running in open mode.)  The request made above should \n\t  signal the server to locate the minion keys for the machine, and if no \n\t  keys are found, to generate them.  The paella server should keep track of \n\t  all the keys and only set the master to accept those that it preseeds.\n\n\t- **NEW** Preseeds the salt-minion with the installer keys.  The keys are present\n\t  as python variables in the script.  The script should be conveyed via ssl.  The \n\t  keys should already be generated upon the initial submission of the machine.\n\n", "id": "preseed"}