{"content": "# System Dependencies\n\n## Short List\n\n- [Vagrant](FIXME)\n\n- [VirtualBox](http://virtualbox.org)\n\n- [Debian Installer](FIXME)\n\n- [Salt](http://github.com/saltstack/salt.git)\n\n- [ACE](FIXME)\n\n- [Pyramid](FIXME)\n\n- [Cornice](FIXME)\n\n- [wimlib](FIXME) - optional\n\n- [ISC Bind](FIXME)\n\n- [ISC DHCPD](FIXME)\n\n- [tftp-hpa](FIXME)\n\n- [Samba](http://samba.org)\n\n- [Apache](http://apache.org)\n\n\n\nFirst, there are the system dependencies.  This may not be the best term, but\nthese dependencies are the selection of implmentations of the various services\nthat paella needs to install and configure systems.  These are things like DNS,\nDHCP, TFTP, HTTP, SMB, etc.  These are dependencies that used, rather than\nused or called directly by the paella python code.  I have chosed\nthe [ISC](FIXME) implementations\nof dns and dhcp, H. Peter Alvin's tftp server, the venerable Apache webserver,\nas well as Samba for implenting stable and reliable services.  While some of\nthese services are much more difficult to configure an operate compared to\nmany of the alternatives I have seen chosen for similar environments, the\nalternatives either do not provide the flexibility, or they don't appear to have\nas many eyes on the code, as the selections that I have made.\n\nSecond, there are the libraries that have been chosen to work with the\npaella application.  These can generally be divided into two classes, python\nand javascript.  This is where the selection of dependencies becomes much\nmore difficult.\n\n[Variations on a Theme](http://en.wikipedia.org/wiki/Variations_on_a_Theme)\n\n[Fugue](http://en.wikipedia.org/wiki/Fugue)\n\nI am hoping that the two links provided above come close to describing\nthe many alternatives that can be chosen to perform similar functions.  This\nis very difficult, and many times I have been left with no choice but to gamble.\n\nWhat is alive today can become dead and unmaintained quickly.  The effects\nmay not be felt until a long time after, but when this happens, something\nhas to be fixed.  What is stable, unchanged and predictable can also be\na sign of stagnation and a forecast for eventual removal from the\ndebian archive could be in the next release.  While it is impossible to\npredict this and keep it from happening, a careful selection of dependencies\ncan drastically reduce the frequency of those types of problems occurring.\n\nWhile some of the system services may be hard to work with and configure, the\nselection of software libraries that paella directly executes has been chosen\nto be as easy to work with as possible, without circumventing important things\nthat may potentially affect the predictability and reliabilty of the code.\n\nNevertheless, there should be at least one or two dependencies that will\nhave to be worked with in the next two years, if history and experience are\nany guide, which is why the selection process is so important, and it has\ntaken much of my time.\n\n## CSS\n\n[cssdev](#pages/cssdev)\n\n## JS\n\n[jsdev](#pages/jsdev)\n", "id": "sysdeps"}