{"content": "# [System Dependencies](#)\n\n## Short List\n\n- [Vagrant](FIXME)\n\n- [VirtualBox](http://virtualbox.org)\n\n- [Debian Installer](FIXME)\n\n- [Salt](http://github.com/saltstack/salt.git)\n\n- [ACE](FIXME)\n\n- [Pyramid](FIXME)\n\n- [Cornice](FIXME)\n\n- [wimlib](FIXME) - optional\n\n- [ISC Bind](FIXME)\n\n- [ISC DHCPD](FIXME)\n\n- [tftp-hpa](FIXME)\n\n- [Samba](http://samba.org)\n\n- [Apache](http://apache.org)\n\n\n\nFirst, there are the system dependencies.  This may not be the best term, but\nthese dependencies are the selection of implmentations of the various services\nthat paella needs to install and configure systems.  These are things like DNS,\nDHCP, TFTP, HTTP, SMB, etc.  These are dependencies that used, rather than\nused or called directly by the paella python code.  I have chosed\nthe [ISC](FIXME) implementations\nof dns and dhcp, H. Peter Alvin's tftp server, the venerable Apache webserver,\nas well as Samba for implenting stable and reliable services.  While some of\nthese services are much more difficult to configure an operate compared to\nmany of the alternatives I have seen chosen for similar environments, the\nalternatives either do not provide the flexibility, or they don't appear to have\nas many eyes on the code, as the selections that I have made.\n\nSecond, there are the libraries that have been chosen to work with the\npaella application.  These can generally be divided into two classes, python\nand javascript.  This is where the selection of dependencies becomes much\nmore difficult.\n\n[Variations on a Theme](http://en.wikipedia.org/wiki/Variations_on_a_Theme)\n\n[Fugue](http://en.wikipedia.org/wiki/Fugue)\n\nI am hoping that the two links provided above come close to describing\nthe many alternatives that can be chosen to perform similar functions.  This\nis very difficult, and many times I have been left with no choice but to gamble.\n\nWhat is alive today can become dead and unmaintained quickly.  The effects\nmay not be felt until a long time after, but when this happens, something\nhas to be fixed.  What is stable, unchanged and predictable can also be\na sign of stagnation and a forecast for eventual removal from the\ndebian archive could be in the next release.  While it is impossible to\npredict this and keep it from happening, a careful selection of dependencies\ncan drastically reduce the frequency of those types of problems occurring.\n\nWhile some of the system services may be hard to work with and configure, the\nselection of software libraries that paella directly executes has been chosen\nto be as easy to work with as possible, without circumventing important things\nthat may potentially affect the predictability and reliabilty of the code.\n\nNevertheless, there should be at least one or two dependencies that will\nhave to be worked with in the next two years, if history and experience are\nany guide, which is why the selection process is so important, and it has\ntaken much of my time.\n\n## Trumpet Static Resources\n \n\n# CSS Authoring\n\n## Compass\n\nThis project uses [compass](http://compass-style.org) to create \nthe [CSS](http://en.wikipedia.org/wiki/Cascading_Style_Sheets) resources \nthat will be used by the web application.  I have chosen to \nuse [Sassy CSS](http://sass-lang.com)\n[docs](http://sass-lang.com/documentation/file.SASS_REFERENCE.html) \nas the syntax to author the css resources.  Being an extension of the \nsyntax of CSS3, any valid css file can be used directly as a scss file,\ndeveloper to fully use the compass framework on css files that have \nalready been designed for other sites.\n\n### Plugins\n\nThis project uses the [bootstrap-sass](https://github.com/twbs/bootstrap-sass) \nplugin for compass, making it easier to customize pages that use the \n[bootstrap](http://getbootstrap.com/) framework.  Also, a helper for \ngenerating [jquery-ui](FIXME) themes,\n[Compass UI](https://github.com/patrickward/compass-ui), is used in \nthis probject.  At full size the bootstrap css file is 291K(120K,\ncompass compressed output), while the jqueryui css file is 77K(31k,\ncompass compressed output).  These sizes can be decreased by delving into\nthe scss provided by the plugins and only using what is needed for the\nparticular application.\n\nThis project provides an example of how both the \nbootstrap and jquery-ui plugins can be configured to use the same \ncolor themes, and there is a python script that generates the\nscss files.  The example is imcomplete, but provides enough to \ndirect the css developer on how to proceed.  A plugin for creating \nbuttons, [Sassy Buttons](http://jaredhardy.com/sassy-buttons/), is also \nbeing used.\n\n### CSS Framework\n\n-  [Compass](http://compass-style.org/):  \n   Compass is the tool I use to generate my CSS resources.\n\n-  [Sassy Buttons](http://jaredhardy.com/sassy-buttons/): \n   This is a collection of mixins and defaults that help a developer make\n   custom buttons very easily.\n\n-  [Bootstrap for Sass](https://github.com/thomas-mcdonald/bootstrap-sass): \n   This wonderful package allows me to refrain from using the css that is \n   provided with bootstrap and quickly make a custom version that I can \n   integrate more closely with other objects on the page.  Having bootstrap \n   in this form allows me to adjust how bootstrap operates and allows me \n   to only choose the parts I need (Currently everything is included).\n   \n-  [FontAwesome](http://fontawesome.io/):\n   Instead of just using the basic css, I have chosen to use the \n   fontawesome-sass distribution.  This provides scalable vector icons\n   to websites.\n   \n-  [Compass UI](https://github.com/patrickward/compass-ui): \n   This compass plugin provides the ability to generate jQueryUI themes\n   with a minimum of effort.  I have spent hours on the themeroller before\n   trying to create a custom theme that would match the general colors that \n   I use on a web page.  With this plugin, all I have to do is set the \n   variables to correspond to the color variables that I use elsewhere on the \n   page and I instantly get themed widgets that don't look like they came \n   from another site.\n   \n\n### Icons\nFinally, [FontAwesome](http://fontawesome.io/), is \nbeing used to provide icons.  The scss files are \ncopied from the\n[git repository](https://github.com/FortAwesome/Font-Awesome/tree/master/scss),\nand may need to be updated.  In the future, I'd like to use\n[font-awesome-sass](https://github.com/FortAwesome/font-awesome-sass) to\ndo this.  In the past, I had trouble integrating this into compass,\nbut it's possible that this problem has disappeared.  If it hasn't\ndisappeared, [bower](http://bower.io) can still be used to track the\nupstream source and use a script to install the scss files into the\nsass/partials directory.\n\n### FullCalendar\n\nThe css file for [FullCalendar](http://arshaw.com/fullcalendar/),\nhas been copied verbatim and renamed to an scss file.  This was \ndone to exemplify how easy it is to directly import css into \nthe project.\n\n## Goals for Authoring Environment\n\nThe primary goal for using compass and scss syntax is to provide \na person who designs webpages the tools to design in a manner they \nare most likely to be comfortable with.  Stylesheets that they have \ndeveloped in other projects can be directly imported, then manipulated \nvery easily.\n\nThe author of this project is a web page designer, but merely a \nweb service/application designer.  The example scss may not be \nthe most pleasing to the eye, and there are many styles variables \nthat have not been modified to match the other colors, and there \nis some work to be done to make the example themes more coherent \nand pleasant.\n\n\n### Basic Javascript Libraries\n\n-  [CoffeeScript](http://coffeescript.org/):\n   The app is written with coffee script.\n  \n-  [Requirejs](http://requirejs.org):\n   This library is required to load the other modules.\n   \n-  [jQuery](http://jquery.com/): \n   jQuery is a very good for selecting and maninpulating elements in the DOM.\n\n-  [jQuery User Interface](http://jqueryui.com/): \n   jQueryUI is used for the fullcalendar widget, as well as for dialog boxes \n   and other user interface elements that aren't used through boostrap.  The \n   corresponding styles are maintained with compass.\n\n-  [Bootstrap v3](http://getbootstrap.com/): \n   Bootstrap is a CSS/Javascript framework used to help make responsive \n   websites.  Bootstrap was selected to be used in order to serve to \n   mobile devices.  The CSS is handled through compass with bootstrap-sass.\n   \n-  [LoDash](FIXME): \n   I decided to use lodash instead of underscore.  Quite a few of the\n   utilities provided by this library are easily handled with coffee script,\n   however, backbone and marionette depend on this library.\n\n-  [Backbone.js](http://backbonejs.org/): \n   Backbone is an excellent library that provides an api to make very \n   rich views tied to models that are seamlessly synchronized with \n   the server via a REST interface.\n\n-  [Marionette](http://marionettejs.com/):\n   \"Backbone.Marionette is a composite application library for \n   Backbone.js that aims to simplify the construction of large scale \n   JavaScript applications,\" and it is very effective at doing this.\n   This is the primary library used in this project for creating \n   single page applications.\n\n-  [Ace Editor](http://ace.c9.io/#nav=about): \n   The ACE editor is a good text editor that is very useful for \n   editing html, css, java/coffee scripts, and other formats that\n   aren't being used yet.\n   \n-  [Teacup](http://goodeggs.github.io/teacup/):\n   I really like teacup.  This selection is a result of a\n   very intensive search and test pattern that looked at\n   many different javascript html templating solutions and\n   teacup really stood out.\n   \n-  [FullCalendar](http://arshaw.com/fullcalendar/): \n   FullCalendar is a very good library that provides an interactive \n   calendar where events can be retrieved dynamically and grouped, \n   colored, or otherwised styled in many ways.  The calendar provides \n   monthly, weekly, and daily view models to interact with.\n   **FullCalendar hasn't been used in paella**\n\n-  [jQuery User Interface](http://jqueryui.com/): \n   jQueryUI is used for the fullcalendar widget, as well as for dialog boxes \n   and other user interface elements that aren't used through boostrap.  The \n   corresponding styles are maintained with compass.\n   **JQueryUI hasn't been used in paella**\n\n", "id": "sysdeps"}