{"content": "# [Paella](#)\n\n## TODO\n\n### General\n\n- **FILE ISSUES ON GITHUB AND GET RID OF THIS TODO**\n\n- need to respect arch decision when installing ostype mswindows\n\n- work on deployment plan\n\n- Start preparing to handle both amd64 and i386. (STARTED)\n\n\t- DONE: make sure debian installs work on both archs\n\t\n\t- make sure that mswindows ostype installs with live system (STARTED)\n\t\n\n- Setup scripts to help with partial repository STARTED\n\n- Move more info into pillar data\n\n  - wipe out all hardcoded entries of '10.0.4.1' to config files or pillar data (DONE)\n\n- Handle different operating system releases\n\n\t- test using debian jessie pxe boot (DONE)\n\t\n\t- windows is left as local exercise due to availability of content\n\t\n\n- Decide how to handle newer UEFI systems.\n\n- Work on [deployment](#pages/deployment) notes.\n\n- Use debian live system to install custom wim image and prepare boot.\n\n- Virtualbox fails to reboot PXE, needs poweroff.  Determine if this is true\nfor both wheezy and jessie.  Verify, then reportbug.\n\n- Implement just enough DNS on paella server to add paella CNAME\nentry.  Fix paella-client to use paella hostname by default for paella server. (DONE)\n\n- Create default disk recipes and some sitetext pages for the paella server.\n\n- Make fstab entries for loopback mounted iso files.\n\n- Three pillar files hold \"paella_server_ip\".  Make sure paella-client talks\nto paella host instead of ip address.  The .ini file that paella sever uses\nalso has \"paella_server_ip\" defined.  In total, there are currently four\nfiles that contain \"paella_server_ip.\"  Consolidate the three pillar files into\na single file, then make notes that there are only two files to adjust when\nchanging \"paella_server_ip\" for vagrant machine. (DONE, all variables should be in bvars.jinja(todo: rename))\n\n- Make note that 10.0.2.0/24 cidr interferes with default NAT addresses\non virtualbox.  Make note that option to change this is commented out\nin Vagrantfile.\n\n- Consider using vagrant rsync updates for some shared directories. (UNSURE IF NEEDED)\n\n\n\n### Paella Server\n\n- Automate key generation and preseed the keys during first stage \n  install.\n  http://docs.saltstack.com/en/latest/topics/tutorials/preseed_key.html\n  - pyramid_celery and rabbitmq to help queue key generation jobs\n  - minion keys are generated and accepted on server on submit machine\n  - minion keys remain in database\n  - keys are installed to minion in configure netboot script (latecmd)\n  - **IMPORTANT** need to enforce ssl on apache to pass data across network\n\n- Implement per machine auto install option when generating install pxe \nconfig file.  Implement a short delay in pxeconfig, but still automatically install\nsystem.\n\n- work on web interface\n\n\t- edit state files with ace editor\n\n\t- change layout a bit and put paella management in it's own page.\n\n\t- create front page  and cleanup unneeded applets **STARTED**\n\n\t- implement specific machine templates.  Create, edit and add/remove\n\tto/from machine.\n\n\t- get wiki/sitetext working properly on web interface.\n\n\t- check pxeconfig on machine update, and refresh pxeconfig if exists.\n\n\t- create interface to assign release to machine.  Release is just simple\n\ttext field with hardcoded entries.  **FIXME** figure out nice way to\n\tmanage release info.\n\t\n\n### Debian Installs\n\n- Can we put the debian installer in an LXC container on the debian-live system?\n\n- Create some simple disk/partition recipes to use as a starting \n  point.(STARTED)\n  - a couple of recipes have been created.\n  - find place in repos to place recipes for db init\n\n- test raid recipes and determine if disklist is needed in database\n  - can we presume disklist on null entry in db?\n\n- need place for kernel cmdline parameters in machine row\n\n- think about making a special section in preseed to handle the  disk options.  The\n  special section will include debconf questions and answers that complement the\n  recipes. It looks like a disk list will be needed to use the raid recipe.  Can I create\n  a reasonable disk list by reading the raid recipe on the server and answering the\n  disk list question in the template?\n\n### Windows Installs\n\n- Look at using streamable WIM's using wimlib.  Serve WIM based on \n  uuid.  Serve unattend.xml based on uuid.\n  \n- Make image capture and submission scripts. Should WIM's get their \n  own database table?\n\n- Make sample autounattend.xml for 64 bit windows.\n\n- handle windows releases other than 7, and also possibly support flavors.\n\n- integrate preexisting windows into paella server on deployment to client network.\n  **IMPORTANT**, I forgot what I meant by this statement.\n\n- look at using wimboot instead of booting winpe iso's.\n\n### Completed!\n\n- DONE: Make scripts for live netboot system to identify machines and set\n  for install.\n  \n- DONE: Make server that accepts POST requests and assigns machine names \n  to mac addresses.\n  \n- DONE: Get server to render preseed files based on name of machine.\n\n- DONE: Get server to create and destroy pxe config files for machines in \n  /var/lib/tftpboot.\n\n- DONE: use system uuid instead of mac addresses: dmidecode -s system-uuid\n\n- DONE: web-interface:  recipe managers\n\n\n", "id": "todo"}