{"content": "# [Paella](#)\n\n## Vagrant\n\n### Introduction\n\nVagrant is used to establish a testing environment for paella.  The \nVagrantfile creates a virtualbox machine with two network interfaces.  The \nsecond network is a virtualbox internal network where the installation system \nis hosted.  The installation system can be tested by creating virtual \nmachines and booting from the internal network to define and install the \nsystem.\n\nAt the moment, there is only the proof of concept installer that installs a \nminimal i386 system.\n\n### Set up the Environment\n\nFirst you will need to have [Virtual Box](http://virtualbox.org) installed \non your system.  Then make sure to download and\ninstall [Vagrant](http://www.vagrantup.com/downloads.html) on your system.  I \nused version 1.5.1 when creating the system.  As of this writing, the \ncurrent version is 1.5.3, which should work, as well as later versions \n1.x.x.  Once vagrant is installed, you will need two plugins.\n\n```sh\nvagrant plugin install vagrant-vbguest\nvagrant plugin install vagrant-salt\n```\n\nThen in the project directory:\n\n```sh\nvagrant up\n```\n\nDepending upon the speed of your network connection, the configuring \nof the virtual machine can take a while.  The small partial debian \nrepository necessary for a simple environment, along with the \nsecurity and salt repositories, is currently just over 600 megabytes \nin size.\n\nThere could be various problems that are reported by the salt provisioner, \ndepending on the availability of network resources.  Most of the problems \nshould be resolvable by executing:\n\n```sh\nvagrant provision\n```\n\nrepeatedly until salt reports no errors.  If there were problems when \ninitially updating the debian repositories, you may have to update them \nlater.  The salt states that manage reprepro could use some work.  The \nbuilding of the live system will depend on the repositories being updated \nand ready.  Otherwise, the state system will get almost everything else \nready.\n\nOnce the salt provisioner reports no errors, you will have to reboot the \nvirtual machine by typing:\n\n```sh\nvagrant reload\n```\n\nWhen the machine boots again, the system should be ready.\n\n### Install a Machine\n\n#### Create a New Virtual Machine\n\nIn the Virtual Box Manager application, create a new machine.  Make \nsure it is set at Operating System: Linux, and Version: Debian.  Otherwise, \nthe default settings in the wizard should be satisfactory.  You need to \nedit the settings of the machine and set the Network Adapter 1 to be attached \nto the Internal Network named \"intloc.\"  If the vagrant machine is already \nprovisioned, this network should already be selectable.\n\nYou may want to click on the System tab and enable Network in the Boot \nOrder, and move it to the top.  If not, you will have to press F12 after \npowering the machine to boot from the network.\n\n#### Boot the Machine\n\nStart the virtual machine and make sure it boots from the network.  If \nyou are presented with a \"First Run Wizard\", you can press cancel as it \nwill attempt to guide you into installing via a cdrom.  You should see a \nscreen of paella and a ten second timer before the machine attempts to \nboot from the hard drive.  Press down and select \"Standard Live System\", \nand then the first entry on the next screen.  This will boot the live\nsystem and allow you to identify the machine and set it to be installed.\n\n#### Using paella client\n\nWhen the live system boots up, you can type:\n\n```sh\npaella-submit-machine <name>\n```\n\nwhere &lt;name&gt; is the name you wish to give the machine to identify it \nby.  This will send an http post request to the server with the name \nand the system uuid of the machine.  The system uuid will be used to \ncreate a special pxe config file that will be presented to the machine \nwhen it is set to be installed.  \n\nAfter this, type:\n\n```sh\npaella-set-install\n```\n\nThis will use the system-uuid to look up the machine in the database and \ntell the server to create the special pxe config file for the machine.  \nOnce this command successfully completes, you can reboot the machine.\n\n### Start the Install\n\nBoot the machine from the network again, and you will see the install \nmenu, with the install option as the first entry.  There is no timeout, \nso you must press enter for the machine to boot.  The machine will then \nboot into an automated debian install, then reboot back into a system \nthat immediately engages in configuring itself using salt.\n\n", "id": "vagrant"}